SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32G0020/MM32G0020_Bootloader/Device/MM32G0020/Include/reg_adc.h
/**
  * @brief ADC_ADSTA Register Bit Definition
  */
#define  ADC_ADSTA_EOSIF_Pos                      (0)
#define  ADC_ADSTA_EOSIF_Msk                      (0x1U << ADC_ADSTA_EOSIF_Pos)                     /*!<End of Sequential Conversion Flag*/
#define  ADC_ADSTA_EOSIF                          ADC_ADSTA_EOSIF_Msk
#define  ADC_ADSTA_AWDIF_Pos                      (1)
#define  ADC_ADSTA_AWDIF_Msk                      (0x1U << ADC_ADSTA_AWDIF_Pos)                     /*!<Analog Watchdog Flag*/
#define  ADC_ADSTA_AWDIF                          ADC_ADSTA_AWDIF_Msk
#define  ADC_ADSTA_BUSY_Pos                       (2)
#define  ADC_ADSTA_BUSY_Msk                       (0x1U << ADC_ADSTA_BUSY_Pos)                      /*!<Non-Injected Conversion Busy/Idle*/
#define  ADC_ADSTA_BUSY                           ADC_ADSTA_BUSY_Msk
#define  ADC_ADSTA_CHANNEL_Pos                    (4)
#define  ADC_ADSTA_CHANNEL_Msk                    (0xFU << ADC_ADSTA_CHANNEL_Pos)                   /*!<Current Convert Channel*/
#define  ADC_ADSTA_CHANNEL                        ADC_ADSTA_CHANNEL_Msk
#define  ADC_ADSTA_CHANNEL_0                      (0x1U << ADC_ADSTA_CHANNEL_Pos) 
#define  ADC_ADSTA_CHANNEL_1                      (0x2U << ADC_ADSTA_CHANNEL_Pos) 
#define  ADC_ADSTA_CHANNEL_2                      (0x4U << ADC_ADSTA_CHANNEL_Pos) 
#define  ADC_ADSTA_CHANNEL_3                      (0x8U << ADC_ADSTA_CHANNEL_Pos) 
#define  ADC_ADSTA_VALID_Pos                      (8)
#define  ADC_ADSTA_VALID_Msk                      (0x1FFU << ADC_ADSTA_VALID_Pos)                   /*!<Valid flag for channel 0 to channel 8*/
#define  ADC_ADSTA_VALID                          ADC_ADSTA_VALID_Msk
#define  ADC_ADSTA_VALID_0                        (0x001U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_1                        (0x002U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_2                        (0x004U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_3                        (0x008U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_4                        (0x010U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_5                        (0x020U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_6                        (0x040U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_7                        (0x080U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_8                        (0x100U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_OVERRUN_Pos                    (20)
#define  ADC_ADSTA_OVERRUN_Msk                    (0x1FFU << ADC_ADSTA_OVERRUN_Pos)                 /*!<Data overrun flag for channel 0 to channel 8*/
#define  ADC_ADSTA_OVERRUN                        ADC_ADSTA_OVERRUN_Msk
#define  ADC_ADSTA_OVERRUN_0                      (0x001U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_1                      (0x002U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_2                      (0x004U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_3                      (0x008U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_4                      (0x010U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_5                      (0x020U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_6                      (0x040U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_7                      (0x080U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_8                      (0x100U << ADC_ADSTA_OVERRUN_Pos) 

/**
  * @brief ADC_ADDR Register Bit Definition
  */
#define  ADC_ADDR_DATA_Pos                        (0)
#define  ADC_ADDR_DATA_Msk                        (0xFFFFU << ADC_ADDR_DATA_Pos)                    /*!<12-bit A/D conversion result from the channel n (Conversion Data)*/
#define  ADC_ADDR_DATA                            ADC_ADDR_DATA_Msk
#define  ADC_ADDR_DATA_0                          (0x0001U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_1                          (0x0002U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_2                          (0x0004U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_3                          (0x0008U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_4                          (0x0010U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_5                          (0x0020U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_6                          (0x0040U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_7                          (0x0080U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_8                          (0x0100U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_9                          (0x0200U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_10                         (0x0400U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_11                         (0x0800U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_12                         (0x1000U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_13                         (0x2000U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_14                         (0x4000U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_15                         (0x8000U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_OVERRUN_Pos                     (20)
#define  ADC_ADDR_OVERRUN_Msk                     (0x1U << ADC_ADDR_OVERRUN_Pos)                    /*!<Data overrun flag (read-only)*/
#define  ADC_ADDR_OVERRUN                         ADC_ADDR_OVERRUN_Msk
#define  ADC_ADDR_VALID_Pos                       (21)
#define  ADC_ADDR_VALID_Msk                       (0x1U << ADC_ADDR_VALID_Pos)                      /*!<Valid flag (read-only)*/
#define  ADC_ADDR_VALID                           ADC_ADDR_VALID_Msk

/**
  * @brief ADC_ADSTA_EXT Register Bit Definition
  */
#define  ADC_ADSTA_EXT_EOSMPIF_Pos                (16)
#define  ADC_ADSTA_EXT_EOSMPIF_Msk                (0x1U << ADC_ADSTA_EXT_EOSMPIF_Pos)               /*!<End of Sample Flag*/
#define  ADC_ADSTA_EXT_EOSMPIF                    ADC_ADSTA_EXT_EOSMPIF_Msk
#define  ADC_ADSTA_EXT_EOCIF_Pos                  (17)
#define  ADC_ADSTA_EXT_EOCIF_Msk                  (0x1U << ADC_ADSTA_EXT_EOCIF_Pos)                 /*!<End of Conversion Flag*/
#define  ADC_ADSTA_EXT_EOCIF                      ADC_ADSTA_EXT_EOCIF_Msk

/**
  * @brief ADC_CHANY0 Register Bit Definition
  */
#define  ADC_CHANY0_CHANY_SEL0_Pos                (0)
#define  ADC_CHANY0_CHANY_SEL0_Msk                (0xFU << ADC_CHANY0_CHANY_SEL0_Pos)               /*!<0th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY0_CHANY_SEL0                    ADC_CHANY0_CHANY_SEL0_Msk
#define  ADC_CHANY0_CHANY_SEL0_0                  (0x1U << ADC_CHANY0_CHANY_SEL0_Pos) 
#define  ADC_CHANY0_CHANY_SEL0_1                  (0x2U << ADC_CHANY0_CHANY_SEL0_Pos) 
#define  ADC_CHANY0_CHANY_SEL0_2                  (0x4U << ADC_CHANY0_CHANY_SEL0_Pos) 
#define  ADC_CHANY0_CHANY_SEL0_3                  (0x8U << ADC_CHANY0_CHANY_SEL0_Pos) 
#define  ADC_CHANY0_CHANY_SEL1_Pos                (4)
#define  ADC_CHANY0_CHANY_SEL1_Msk                (0xFU << ADC_CHANY0_CHANY_SEL1_Pos)               /*!<1th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY0_CHANY_SEL1                    ADC_CHANY0_CHANY_SEL1_Msk
#define  ADC_CHANY0_CHANY_SEL1_0                  (0x1U << ADC_CHANY0_CHANY_SEL1_Pos) 
#define  ADC_CHANY0_CHANY_SEL1_1                  (0x2U << ADC_CHANY0_CHANY_SEL1_Pos) 
#define  ADC_CHANY0_CHANY_SEL1_2                  (0x4U << ADC_CHANY0_CHANY_SEL1_Pos) 
#define  ADC_CHANY0_CHANY_SEL1_3                  (0x8U << ADC_CHANY0_CHANY_SEL1_Pos) 
#define  ADC_CHANY0_CHANY_SEL2_Pos                (8)
#define  ADC_CHANY0_CHANY_SEL2_Msk                (0xFU << ADC_CHANY0_CHANY_SEL2_Pos)               /*!<2th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY0_CHANY_SEL2                    ADC_CHANY0_CHANY_SEL2_Msk
#define  ADC_CHANY0_CHANY_SEL2_0                  (0x1U << ADC_CHANY0_CHANY_SEL2_Pos) 
#define  ADC_CHANY0_CHANY_SEL2_1                  (0x2U << ADC_CHANY0_CHANY_SEL2_Pos) 
#define  ADC_CHANY0_CHANY_SEL2_2                  (0x4U << ADC_CHANY0_CHANY_SEL2_Pos) 
#define  ADC_CHANY0_CHANY_SEL2_3                  (0x8U << ADC_CHANY0_CHANY_SEL2_Pos) 
#define  ADC_CHANY0_CHANY_SEL3_Pos                (12)
#define  ADC_CHANY0_CHANY_SEL3_Msk                (0xFU << ADC_CHANY0_CHANY_SEL3_Pos)               /*!<3th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY0_CHANY_SEL3                    ADC_CHANY0_CHANY_SEL3_Msk
#define  ADC_CHANY0_CHANY_SEL3_0                  (0x1U << ADC_CHANY0_CHANY_SEL3_Pos) 
#define  ADC_CHANY0_CHANY_SEL3_1                  (0x2U << ADC_CHANY0_CHANY_SEL3_Pos) 
#define  ADC_CHANY0_CHANY_SEL3_2                  (0x4U << ADC_CHANY0_CHANY_SEL3_Pos) 
#define  ADC_CHANY0_CHANY_SEL3_3                  (0x8U << ADC_CHANY0_CHANY_SEL3_Pos) 
#define  ADC_CHANY0_CHANY_SEL4_Pos                (16)
#define  ADC_CHANY0_CHANY_SEL4_Msk                (0xFU << ADC_CHANY0_CHANY_SEL4_Pos)               /*!<4th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY0_CHANY_SEL4                    ADC_CHANY0_CHANY_SEL4_Msk
#define  ADC_CHANY0_CHANY_SEL4_0                  (0x1U << ADC_CHANY0_CHANY_SEL4_Pos) 
#define  ADC_CHANY0_CHANY_SEL4_1                  (0x2U << ADC_CHANY0_CHANY_SEL4_Pos) 
#define  ADC_CHANY0_CHANY_SEL4_2                  (0x4U << ADC_CHANY0_CHANY_SEL4_Pos) 
#define  ADC_CHANY0_CHANY_SEL4_3                  (0x8U << ADC_CHANY0_CHANY_SEL4_Pos) 
#define  ADC_CHANY0_CHANY_SEL5_Pos                (20)
#define  ADC_CHANY0_CHANY_SEL5_Msk                (0xFU << ADC_CHANY0_CHANY_SEL5_Pos)               /*!<5th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY0_CHANY_SEL5                    ADC_CHANY0_CHANY_SEL5_Msk
#define  ADC_CHANY0_CHANY_SEL5_0                  (0x1U << ADC_CHANY0_CHANY_SEL5_Pos) 
#define  ADC_CHANY0_CHANY_SEL5_1                  (0x2U << ADC_CHANY0_CHANY_SEL5_Pos) 
#define  ADC_CHANY0_CHANY_SEL5_2                  (0x4U << ADC_CHANY0_CHANY_SEL5_Pos) 
#define  ADC_CHANY0_CHANY_SEL5_3                  (0x8U << ADC_CHANY0_CHANY_SEL5_Pos) 
#define  ADC_CHANY0_CHANY_SEL6_Pos                (24)
#define  ADC_CHANY0_CHANY_SEL6_Msk                (0xFU << ADC_CHANY0_CHANY_SEL6_Pos)               /*!<6th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY0_CHANY_SEL6                    ADC_CHANY0_CHANY_SEL6_Msk
#define  ADC_CHANY0_CHANY_SEL6_0                  (0x1U << ADC_CHANY0_CHANY_SEL6_Pos) 
#define  ADC_CHANY0_CHANY_SEL6_1                  (0x2U << ADC_CHANY0_CHANY_SEL6_Pos) 
#define  ADC_CHANY0_CHANY_SEL6_2                  (0x4U << ADC_CHANY0_CHANY_SEL6_Pos) 
#define  ADC_CHANY0_CHANY_SEL6_3                  (0x8U << ADC_CHANY0_CHANY_SEL6_Pos) 
#define  ADC_CHANY0_CHANY_SEL7_Pos                (28)
#define  ADC_CHANY0_CHANY_SEL7_Msk                (0xFU << ADC_CHANY0_CHANY_SEL7_Pos)               /*!<7th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY0_CHANY_SEL7                    ADC_CHANY0_CHANY_SEL7_Msk
#define  ADC_CHANY0_CHANY_SEL7_0                  (0x1U << ADC_CHANY0_CHANY_SEL7_Pos) 
#define  ADC_CHANY0_CHANY_SEL7_1                  (0x2U << ADC_CHANY0_CHANY_SEL7_Pos) 
#define  ADC_CHANY0_CHANY_SEL7_2                  (0x4U << ADC_CHANY0_CHANY_SEL7_Pos) 
#define  ADC_CHANY0_CHANY_SEL7_3                  (0x8U << ADC_CHANY0_CHANY_SEL7_Pos) 

/**
  * @brief ADC_CHANY1 Register Bit Definition
  */
#define  ADC_CHANY1_CHANY_SEL8_Pos                (0)
#define  ADC_CHANY1_CHANY_SEL8_Msk                (0xFU << ADC_CHANY1_CHANY_SEL8_Pos)               /*!<8th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL8                    ADC_CHANY1_CHANY_SEL8_Msk
#define  ADC_CHANY1_CHANY_SEL8_0                  (0x1U << ADC_CHANY1_CHANY_SEL8_Pos) 
#define  ADC_CHANY1_CHANY_SEL8_1                  (0x2U << ADC_CHANY1_CHANY_SEL8_Pos) 
#define  ADC_CHANY1_CHANY_SEL8_2                  (0x4U << ADC_CHANY1_CHANY_SEL8_Pos) 
#define  ADC_CHANY1_CHANY_SEL8_3                  (0x8U << ADC_CHANY1_CHANY_SEL8_Pos) 
#define  ADC_CHANY1_CHANY_SEL9_Pos                (4)
#define  ADC_CHANY1_CHANY_SEL9_Msk                (0xFU << ADC_CHANY1_CHANY_SEL9_Pos)               /*!<9th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL9                    ADC_CHANY1_CHANY_SEL9_Msk
#define  ADC_CHANY1_CHANY_SEL9_0                  (0x1U << ADC_CHANY1_CHANY_SEL9_Pos) 
#define  ADC_CHANY1_CHANY_SEL9_1                  (0x2U << ADC_CHANY1_CHANY_SEL9_Pos) 
#define  ADC_CHANY1_CHANY_SEL9_2                  (0x4U << ADC_CHANY1_CHANY_SEL9_Pos) 
#define  ADC_CHANY1_CHANY_SEL9_3                  (0x8U << ADC_CHANY1_CHANY_SEL9_Pos) 
#define  ADC_CHANY1_CHANY_SEL10_Pos               (8)
#define  ADC_CHANY1_CHANY_SEL10_Msk               (0xFU << ADC_CHANY1_CHANY_SEL10_Pos)              /*!<10th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL10                   ADC_CHANY1_CHANY_SEL10_Msk
#define  ADC_CHANY1_CHANY_SEL10_0                 (0x1U << ADC_CHANY1_CHANY_SEL10_Pos) 
#define  ADC_CHANY1_CHANY_SEL10_1                 (0x2U << ADC_CHANY1_CHANY_SEL10_Pos) 
#define  ADC_CHANY1_CHANY_SEL10_2                 (0x4U << ADC_CHANY1_CHANY_SEL10_Pos) 
#define  ADC_CHANY1_CHANY_SEL10_3                 (0x8U << ADC_CHANY1_CHANY_SEL10_Pos) 
#define  ADC_CHANY1_CHANY_SEL11_Pos               (12)
#define  ADC_CHANY1_CHANY_SEL11_Msk               (0xFU << ADC_CHANY1_CHANY_SEL11_Pos)              /*!<11th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL11                   ADC_CHANY1_CHANY_SEL11_Msk
#define  ADC_CHANY1_CHANY_SEL11_0                 (0x1U << ADC_CHANY1_CHANY_SEL11_Pos) 
#define  ADC_CHANY1_CHANY_SEL11_1                 (0x2U << ADC_CHANY1_CHANY_SEL11_Pos) 
#define  ADC_CHANY1_CHANY_SEL11_2                 (0x4U << ADC_CHANY1_CHANY_SEL11_Pos) 
#define  ADC_CHANY1_CHANY_SEL11_3                 (0x8U << ADC_CHANY1_CHANY_SEL11_Pos) 
#define  ADC_CHANY1_CHANY_SEL12_Pos               (16)
#define  ADC_CHANY1_CHANY_SEL12_Msk               (0xFU << ADC_CHANY1_CHANY_SEL12_Pos)              /*!<12th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL12                   ADC_CHANY1_CHANY_SEL12_Msk
#define  ADC_CHANY1_CHANY_SEL12_0                 (0x1U << ADC_CHANY1_CHANY_SEL12_Pos) 
#define  ADC_CHANY1_CHANY_SEL12_1                 (0x2U << ADC_CHANY1_CHANY_SEL12_Pos) 
#define  ADC_CHANY1_CHANY_SEL12_2                 (0x4U << ADC_CHANY1_CHANY_SEL12_Pos) 
#define  ADC_CHANY1_CHANY_SEL12_3                 (0x8U << ADC_CHANY1_CHANY_SEL12_Pos) 
#define  ADC_CHANY1_CHANY_SEL13_Pos               (20)
#define  ADC_CHANY1_CHANY_SEL13_Msk               (0xFU << ADC_CHANY1_CHANY_SEL13_Pos)              /*!<13th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL13                   ADC_CHANY1_CHANY_SEL13_Msk
#define  ADC_CHANY1_CHANY_SEL13_0                 (0x1U << ADC_CHANY1_CHANY_SEL13_Pos) 
#define  ADC_CHANY1_CHANY_SEL13_1                 (0x2U << ADC_CHANY1_CHANY_SEL13_Pos) 
#define  ADC_CHANY1_CHANY_SEL13_2                 (0x4U << ADC_CHANY1_CHANY_SEL13_Pos) 
#define  ADC_CHANY1_CHANY_SEL13_3                 (0x8U << ADC_CHANY1_CHANY_SEL13_Pos) 
#define  ADC_CHANY1_CHANY_SEL14_Pos               (24)
#define  ADC_CHANY1_CHANY_SEL14_Msk               (0xFU << ADC_CHANY1_CHANY_SEL14_Pos)              /*!<14th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL14                   ADC_CHANY1_CHANY_SEL14_Msk
#define  ADC_CHANY1_CHANY_SEL14_0                 (0x1U << ADC_CHANY1_CHANY_SEL14_Pos) 
#define  ADC_CHANY1_CHANY_SEL14_1                 (0x2U << ADC_CHANY1_CHANY_SEL14_Pos) 
#define  ADC_CHANY1_CHANY_SEL14_2                 (0x4U << ADC_CHANY1_CHANY_SEL14_Pos) 
#define  ADC_CHANY1_CHANY_SEL14_3                 (0x8U << ADC_CHANY1_CHANY_SEL14_Pos) 
#define  ADC_CHANY1_CHANY_SEL15_Pos               (28)
#define  ADC_CHANY1_CHANY_SEL15_Msk               (0xFU << ADC_CHANY1_CHANY_SEL15_Pos)              /*!<15th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL15                   ADC_CHANY1_CHANY_SEL15_Msk
#define  ADC_CHANY1_CHANY_SEL15_0                 (0x1U << ADC_CHANY1_CHANY_SEL15_Pos) 
#define  ADC_CHANY1_CHANY_SEL15_1                 (0x2U << ADC_CHANY1_CHANY_SEL15_Pos) 
#define  ADC_CHANY1_CHANY_SEL15_2                 (0x4U << ADC_CHANY1_CHANY_SEL15_Pos) 
#define  ADC_CHANY1_CHANY_SEL15_3                 (0x8U << ADC_CHANY1_CHANY_SEL15_Pos) 

/**
  * @brief ADC_ANY_CFG Register Bit Definition
  */
#define  ADC_ANY_CFG_CHANY_NUM_Pos                (0)
#define  ADC_ANY_CFG_CHANY_NUM_Msk                (0xFU << ADC_ANY_CFG_CHANY_NUM_Pos)               /*!<Number of Any Channel Mode*/
#define  ADC_ANY_CFG_CHANY_NUM                    ADC_ANY_CFG_CHANY_NUM_Msk
#define  ADC_ANY_CFG_CHANY_NUM_0                  (0x1U << ADC_ANY_CFG_CHANY_NUM_Pos) 
#define  ADC_ANY_CFG_CHANY_NUM_1                  (0x2U << ADC_ANY_CFG_CHANY_NUM_Pos) 
#define  ADC_ANY_CFG_CHANY_NUM_2                  (0x4U << ADC_ANY_CFG_CHANY_NUM_Pos) 
#define  ADC_ANY_CFG_CHANY_NUM_3                  (0x8U << ADC_ANY_CFG_CHANY_NUM_Pos) 

/**
  * @brief ADC_ANY_CR Register Bit Definition
  */
#define  ADC_ANY_CR_CHANY_MDEN_Pos                (0)
#define  ADC_ANY_CR_CHANY_MDEN_Msk                (0x1U << ADC_ANY_CR_CHANY_MDEN_Pos)               /*!<Any Channel Mode Enable*/
#define  ADC_ANY_CR_CHANY_MDEN                    ADC_ANY_CR_CHANY_MDEN_Msk

/**
  * @brief ADC_SMPR1 Register Bit Definition
  */
#define  ADC_SMPR1_SAMP0_Pos                      (0)
#define  ADC_SMPR1_SAMP0_Msk                      (0xFU << ADC_SMPR1_SAMP0_Pos)                     /*!<Channel 0~7 Sample Time Selection*/
#define  ADC_SMPR1_SAMP0                          ADC_SMPR1_SAMP0_Msk
#define  ADC_SMPR1_SAMP0_0                        (0x1U << ADC_SMPR1_SAMP0_Pos) 
#define  ADC_SMPR1_SAMP0_1                        (0x2U << ADC_SMPR1_SAMP0_Pos) 
#define  ADC_SMPR1_SAMP0_2                        (0x4U << ADC_SMPR1_SAMP0_Pos) 
#define  ADC_SMPR1_SAMP0_3                        (0x8U << ADC_SMPR1_SAMP0_Pos) 
#define  ADC_SMPR1_SAMP1_Pos                      (4)
#define  ADC_SMPR1_SAMP1_Msk                      (0xFU << ADC_SMPR1_SAMP1_Pos)                     /*!<Channel 0~7 Sample Time Selection*/
#define  ADC_SMPR1_SAMP1                          ADC_SMPR1_SAMP1_Msk
#define  ADC_SMPR1_SAMP1_0                        (0x1U << ADC_SMPR1_SAMP1_Pos) 
#define  ADC_SMPR1_SAMP1_1                        (0x2U << ADC_SMPR1_SAMP1_Pos) 
#define  ADC_SMPR1_SAMP1_2                        (0x4U << ADC_SMPR1_SAMP1_Pos) 
#define  ADC_SMPR1_SAMP1_3                        (0x8U << ADC_SMPR1_SAMP1_Pos) 
#define  ADC_SMPR1_SAMP2_Pos                      (8)
#define  ADC_SMPR1_SAMP2_Msk                      (0xFU << ADC_SMPR1_SAMP2_Pos)                     /*!<Channel 0~7 Sample Time Selection*/
#define  ADC_SMPR1_SAMP2                          ADC_SMPR1_SAMP2_Msk
#define  ADC_SMPR1_SAMP2_0                        (0x1U << ADC_SMPR1_SAMP2_Pos) 
#define  ADC_SMPR1_SAMP2_1                        (0x2U << ADC_SMPR1_SAMP2_Pos) 
#define  ADC_SMPR1_SAMP2_2                        (0x4U << ADC_SMPR1_SAMP2_Pos) 
#define  ADC_SMPR1_SAMP2_3                        (0x8U << ADC_SMPR1_SAMP2_Pos) 
#define  ADC_SMPR1_SAMP3_Pos                      (12)
#define  ADC_SMPR1_SAMP3_Msk                      (0xFU << ADC_SMPR1_SAMP3_Pos)                     /*!<Channel 0~7 Sample Time Selection*/
#define  ADC_SMPR1_SAMP3                          ADC_SMPR1_SAMP3_Msk
#define  ADC_SMPR1_SAMP3_0                        (0x1U << ADC_SMPR1_SAMP3_Pos) 
#define  ADC_SMPR1_SAMP3_1                        (0x2U << ADC_SMPR1_SAMP3_Pos) 
#define  ADC_SMPR1_SAMP3_2                        (0x4U << ADC_SMPR1_SAMP3_Pos) 
#define  ADC_SMPR1_SAMP3_3                        (0x8U << ADC_SMPR1_SAMP3_Pos) 
#define  ADC_SMPR1_SAMP4_Pos                      (16)
#define  ADC_SMPR1_SAMP4_Msk                      (0xFU << ADC_SMPR1_SAMP4_Pos)                     /*!<Channel 0~7 Sample Time Selection*/
#define  ADC_SMPR1_SAMP4                          ADC_SMPR1_SAMP4_Msk
#define  ADC_SMPR1_SAMP4_0                        (0x1U << ADC_SMPR1_SAMP4_Pos) 
#define  ADC_SMPR1_SAMP4_1                        (0x2U << ADC_SMPR1_SAMP4_Pos) 
#define  ADC_SMPR1_SAMP4_2                        (0x4U << ADC_SMPR1_SAMP4_Pos) 
#define  ADC_SMPR1_SAMP4_3                        (0x8U << ADC_SMPR1_SAMP4_Pos) 
#define  ADC_SMPR1_SAMP5_Pos                      (20)
#define  ADC_SMPR1_SAMP5_Msk                      (0xFU << ADC_SMPR1_SAMP5_Pos)                     /*!<Channel 0~7 Sample Time Selection*/
#define  ADC_SMPR1_SAMP5                          ADC_SMPR1_SAMP5_Msk
#define  ADC_SMPR1_SAMP5_0                        (0x1U << ADC_SMPR1_SAMP5_Pos) 
#define  ADC_SMPR1_SAMP5_1                        (0x2U << ADC_SMPR1_SAMP5_Pos) 
#define  ADC_SMPR1_SAMP5_2                        (0x4U << ADC_SMPR1_SAMP5_Pos) 
#define  ADC_SMPR1_SAMP5_3                        (0x8U << ADC_SMPR1_SAMP5_Pos) 
#define  ADC_SMPR1_SAMP6_Pos                      (24)
#define  ADC_SMPR1_SAMP6_Msk                      (0xFU << ADC_SMPR1_SAMP6_Pos)                     /*!<Channel 0~7 Sample Time Selection*/
#define  ADC_SMPR1_SAMP6                          ADC_SMPR1_SAMP6_Msk
#define  ADC_SMPR1_SAMP6_0                        (0x1U << ADC_SMPR1_SAMP6_Pos) 
#define  ADC_SMPR1_SAMP6_1                        (0x2U << ADC_SMPR1_SAMP6_Pos) 
#define  ADC_SMPR1_SAMP6_2                        (0x4U << ADC_SMPR1_SAMP6_Pos) 
#define  ADC_SMPR1_SAMP6_3                        (0x8U << ADC_SMPR1_SAMP6_Pos) 
#define  ADC_SMPR1_SAMP7_Pos                      (28)
#define  ADC_SMPR1_SAMP7_Msk                      (0xFU << ADC_SMPR1_SAMP7_Pos)                     /*!<Channel 0~7 Sample Time Selection*/
#define  ADC_SMPR1_SAMP7                          ADC_SMPR1_SAMP7_Msk
#define  ADC_SMPR1_SAMP7_0                        (0x1U << ADC_SMPR1_SAMP7_Pos) 
#define  ADC_SMPR1_SAMP7_1                        (0x2U << ADC_SMPR1_SAMP7_Pos) 
#define  ADC_SMPR1_SAMP7_2                        (0x4U << ADC_SMPR1_SAMP7_Pos) 
#define  ADC_SMPR1_SAMP7_3                        (0x8U << ADC_SMPR1_SAMP7_Pos) 

/**
  * @brief ADC_SMPR2 Register Bit Definition
  */
#define  ADC_SMPR2_SAMP8_Pos                      (0)
#define  ADC_SMPR2_SAMP8_Msk                      (0xFU << ADC_SMPR2_SAMP8_Pos)                     /*!<Channel 8 Sample Time Selection*/
#define  ADC_SMPR2_SAMP8                          ADC_SMPR2_SAMP8_Msk
#define  ADC_SMPR2_SAMP8_0                        (0x1U << ADC_SMPR2_SAMP8_Pos) 
#define  ADC_SMPR2_SAMP8_1                        (0x2U << ADC_SMPR2_SAMP8_Pos) 
#define  ADC_SMPR2_SAMP8_2                        (0x4U << ADC_SMPR2_SAMP8_Pos) 
#define  ADC_SMPR2_SAMP8_3                        (0x8U << ADC_SMPR2_SAMP8_Pos) 

/** ------------------------------------------------------------------------------------------------------------------*/
#endif
/** ------------------------------------------------------------------------------------------------------------------*/
